src/cfe/КСП/InformationRegisters/ксп_МэппингСправочникВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_МэппингСправочникВидыЦен</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ксп_МэппингСправочникВидыЦен/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	GUID 	- строка - 36 символов, ГУИД
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПоМэппингу(GUID, ВнешняяСистема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.ВидЦены КАК ВидЦены
		|ИЗ
		|	РегистрСведений.ксп_МэппингСправочникВидыЦен КАК Рег
		|ГДЕ
		|	Рег.GUID = &GUID
		|	И Рег.ВнешняяСистема = &ВнешняяСистема";
	
	Запрос.УстановитьПараметр("GUID", GUID);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ВидЦены;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции




Функция ЕстьГУИД(GUID, ВнешняяСистема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 1
		|ИЗ
		|	РегистрСведений.ксп_МэппингСправочникВидыЦен КАК Рег
		|ГДЕ
		|	Рег.GUID = &GUID
		|	И Рег.ВнешняяСистема = &ВнешняяСистема";
	
	Запрос.УстановитьПараметр("GUID", GUID);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Возврат НЕ РезультатЗапроса.Пустой();
		
КонецФункции


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьГУИД(GUID, Наименование, ВнешняяСистема) Экспорт
	
	НЗ = РегистрыСведений.ксп_МэппингСправочникВидыЦен.СоздатьНаборЗаписей();
	НЗ.Отбор.GUID.Установить(GUID);
	НЗ.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	стрк = НЗ.Добавить();
	стрк.GUID = GUID;
	стрк.Наименование = Наименование;  
	стрк.ВнешняяСистема = ВнешняяСистема;	
	НЗ.Записать();
		
КонецПроцедуры


Процедура ДобавитьЗапись(GUID, Наименование, ВнешняяСистема, ВидЦены) Экспорт
	
	НЗ = РегистрыСведений.ксп_МэппингСправочникВидыЦен.СоздатьНаборЗаписей();
	НЗ.Отбор.GUID.Установить(GUID);
	НЗ.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	стрк = НЗ.Добавить();
	стрк.GUID = GUID;
	стрк.Наименование = Наименование;  
	стрк.ВнешняяСистема = ВнешняяСистема;	
	стрк.ВидЦены = ВидЦены;	
	НЗ.Записать();
		
КонецПроцедуры
